tap "homebrew/bundle"
tap "powershell/tap"
brew "cowsay"
brew "curl"
brew "jq"
brew "lolcat"
brew "mas"
brew "python@3.13"
brew "maven"
brew "neovim"
brew "node"
brew "openjdk@21"
brew "pandoc"
brew "pipx"
brew "powershell/tap/powershell"
cask "blender"
cask "boop"
cask "font-hack-nerd-font"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "obsidian"
cask "orbstack"
cask "rectangle"
cask "warp"
mas "AdBlock Pro", id: 1018301773
mas "CapCut", id: 1500855883
mas "Consent-O-Matic", id: 1606897889
mas "Game Of Life", id: 1377718068
mas "GarageBand", id: 682658836
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MyWallpaper", id: 1552826194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PayPal Honey", id: 1472777122
mas "Prime Video", id: 545519333
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "aaron00101010.http-client"
vscode "albert.tabout"
vscode "austenc.tailwind-docs"
vscode "awesomektvn.toggle-semicolon"
vscode "bradlc.vscode-tailwindcss"
vscode "caolin.java-run"
vscode "christian-kohler.npm-intellisense"
vscode "chrisvltn.vs-code-semicolon-insertion"
vscode "codium.codium"
vscode "continue.continue"
vscode "danielsanmedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "gforcedev.ctrl-semicolon"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "mhutchie.git-graph"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "oracle.oracle-java"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "rangav.vscode-thunder-client"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "supermaven.supermaven"
vscode "tal7aouy.rainbow-bracket"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "xaver.clang-format"
vscode "yzane.markdown-pdf"
